In [1]:
# --- Importing pandas ---
import pandas as pd

In [2]:
# --- Reading a CSV into a DataFrame ---
df = pd.read_csv('csv/professionals.csv')
# --- Viewing column labels ---
list(df.columns)

['name', 'age', 'occupation']

In [3]:
df

   name  age  occupation
0  alex   28     teacher
1   sue   29  programmer
2   max   27      doctor

In [4]:
# --- Adding a column to a DataFrame ---
df['salary'] = [25000, 35000, 40000]
df

   name  age  occupation  salary
0  alex   28     teacher   25000
1   sue   29  programmer   35000
2   max   27      doctor   40000

In [5]:
# --- Adding a row to a DataFrame ---
df.loc[3] = ['anthony', 27, 'designer', 50000]
df

      name  age  occupation  salary
0     alex   28     teacher   25000
1      sue   29  programmer   35000
2      max   27      doctor   40000
3  anthony   27    designer   50000

In [6]:
df = pd.DataFrame(
    {'name': ['alex', 'sue', 'max'],
     'age': [28, 29, 27],
     'occupation': ['teacher', 'programmer', 'doctor']})

# Save the DataFrame as a CSV file:
df.to_csv('csv/professionalsSvd.csv', index=False)